# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# Binaries
brew 'awscli'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # Required for imagick build

# Development
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'php'
brew 'php@7.4'
#brew 'php@7.2'
brew 'redis'
brew 'svgo'

# Apps
cask '1password'
#cask '1password-cli'
#cask 'adobe-creative-cloud'
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
#cask 'logitech-options'
#cask 'microsoft-edge'
cask 'microsoft-teams'
#cask 'mysqlworkbench'
cask 'sequel-ace'
#cask 'setapp'
#cask 'sketch'
#cask 'slack'
cask 'spotify'
#cask 'sublime-text'
#cask 'tableplus'
#cask 'the-unarchiver'
cask 'tinkerwell'
#cask 'trello'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Moom', id: 419330170
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
#mas 'Spark', id: 1176895641