# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'pkg-config' # Required for imagick build

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'composer'
# brew 'imagemagick'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'php'
# brew 'php@7.4'
# brew 'php@7.2'
# brew 'redis'
# brew 'yarn'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'arc'
cask 'discord'
# cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'herd'
# cask 'imageoptim'
# cask 'iterm2'
cask 'jetbrains-toolbox'
# cask 'logitech-options'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'notion'
cask 'opera'
cask 'postman'
cask 'raycast'
cask 'setapp'
cask 'sketch'
cask 'spotify'
cask 'tinkerwell'
# cask 'visual-studio-code'
cask 'warp'

# Fonts
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Moom', id: 419330170
# mas 'Spark', id: 1176895641
