# Taps
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
# brew 'mackup'
brew 'mas' # Mac App Store manager

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'arc'
cask 'chatgpt'
cask 'discord'
# cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'herd'
# cask 'imageoptim'
# cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'logi-options+'
# cask "microsoft-auto-update"
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'notion'
cask 'opera'
cask 'postman'
cask 'raycast'
cask 'runjs'
cask 'setapp'
cask 'sketch'
cask 'spotify'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'warp'

# Fonts
cask 'font-fira-code-nerd-font'

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas 'Spark', id: 1176895641
