# Binaries
brew 'awscli'
brew 'bat'
brew 'duti'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'gitleaks'
brew 'jq'
# brew 'mackup' # Disabled until https://github.com/lra/mackup?tab=readme-ov-file#warning is resolved
brew 'mas'
brew 'opencode'
brew 'ripgrep'
brew 'shellcheck'
brew 'spaceship'
brew 'zoxide'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'libavif'

# Apps
# Inline comments flag the license model for casks that need payment to use beyond install.
cask '1password'              # subscription required
cask 'adobe-creative-cloud'   # launcher only; apps require Creative Cloud subscription
cask 'chatgpt'
cask 'claude'
cask 'discord'
cask 'elgato-camera-hub'
cask 'elgato-control-center'
cask 'elgato-wave-link'
cask 'firefox'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'herd'                   # free tier; Pro requires subscription
cask 'iina'
cask 'jetbrains-toolbox'      # launcher free; each IDE requires its own license
cask 'logi-options+'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'
cask 'opencode-desktop'
cask 'opera'
cask 'plexamp'                # requires Plex Pass
cask 'postman'
cask 'raycast'
cask 'readdle-spark'          # free tier limited; Premium requires subscription
cask 'runjs'                  # paid; has trial
cask 'setapp'                 # subscription required to use any bundled app
cask 'spotify'
cask 'thebrowsercompany-dia'
cask 'tinkerwell'             # paid; has trial
cask 'visual-studio-code'
cask 'warp'
cask 'wispr-flow'

# QuickLook Plugins
cask 'betterzip'              # QL extension free; full app paid (we only use the QL)
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'suspicious-package'
cask 'syntax-highlight'

# Fonts
cask 'font-fira-code-nerd-font'

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
